backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [input_3, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 224, 224, 3]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv1
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn_conv1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: bn_conv1
  - class_name: Activation
    config: {activation: relu, name: activation_50, trainable: true}
    inbound_nodes:
    - - - bn_conv1
        - 0
        - 0
        - {}
    name: activation_50
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_12
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_50
        - 0
        - 0
        - {}
    name: max_pooling2d_12
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple [1, 1]
      name: res2a_branch2a
      padding: valid
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_12
        - 0
        - 0
        - {}
    name: res2a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2a
        - 0
        - 0
        - {}
    name: bn2a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_51, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2a
        - 0
        - 0
        - {}
    name: activation_51
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2a_branch2b
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_51
        - 0
        - 0
        - {}
    name: res2a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2b
        - 0
        - 0
        - {}
    name: bn2a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_52, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2b
        - 0
        - 0
        - {}
    name: activation_52
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple [1, 1]
      name: res2a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_52
        - 0
        - 0
        - {}
    name: res2a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [1, 1]
      name: res2a_branch1
      padding: valid
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_12
        - 0
        - 0
        - {}
    name: res2a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2c
        - 0
        - 0
        - {}
    name: bn2a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch1
        - 0
        - 0
        - {}
    name: bn2a_branch1
  - class_name: Add
    config: {name: add_17, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2c
        - 0
        - 0
        - &id004 {}
      - - bn2a_branch1
        - 0
        - 0
        - *id004
    name: add_17
  - class_name: Activation
    config: {activation: relu, name: activation_53, trainable: true}
    inbound_nodes:
    - - - add_17
        - 0
        - 0
        - {}
    name: activation_53
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: res2b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_53
        - 0
        - 0
        - {}
    name: res2b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2a
        - 0
        - 0
        - {}
    name: bn2b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_54, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2a
        - 0
        - 0
        - {}
    name: activation_54
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_54
        - 0
        - 0
        - {}
    name: res2b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2b
        - 0
        - 0
        - {}
    name: bn2b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_55, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2b
        - 0
        - 0
        - {}
    name: activation_55
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id007 !!python/tuple [1, 1]
      name: res2b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_55
        - 0
        - 0
        - {}
    name: res2b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2c
        - 0
        - 0
        - {}
    name: bn2b_branch2c
  - class_name: Add
    config: {name: add_18, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2c
        - 0
        - 0
        - &id005 {}
      - - activation_53
        - 0
        - 0
        - *id005
    name: add_18
  - class_name: Activation
    config: {activation: relu, name: activation_56, trainable: true}
    inbound_nodes:
    - - - add_18
        - 0
        - 0
        - {}
    name: activation_56
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res2c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_56
        - 0
        - 0
        - {}
    name: res2c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2a
        - 0
        - 0
        - {}
    name: bn2c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_57, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2a
        - 0
        - 0
        - {}
    name: activation_57
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_57
        - 0
        - 0
        - {}
    name: res2c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2b
        - 0
        - 0
        - {}
    name: bn2c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_58, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2b
        - 0
        - 0
        - {}
    name: activation_58
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res2c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_58
        - 0
        - 0
        - {}
    name: res2c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2c
        - 0
        - 0
        - {}
    name: bn2c_branch2c
  - class_name: Add
    config: {name: add_19, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2c
        - 0
        - 0
        - &id008 {}
      - - activation_56
        - 0
        - 0
        - *id008
    name: add_19
  - class_name: Activation
    config: {activation: relu, name: activation_59, trainable: true}
    inbound_nodes:
    - - - add_19
        - 0
        - 0
        - {}
    name: activation_59
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res3a_branch2a
      padding: valid
      strides: &id012 !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_59
        - 0
        - 0
        - {}
    name: res3a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2a
        - 0
        - 0
        - {}
    name: bn3a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_60, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2a
        - 0
        - 0
        - {}
    name: activation_60
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_60
        - 0
        - 0
        - {}
    name: res3a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2b
        - 0
        - 0
        - {}
    name: bn3a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_61, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2b
        - 0
        - 0
        - {}
    name: activation_61
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res3a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_61
        - 0
        - 0
        - {}
    name: res3a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res3a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_59
        - 0
        - 0
        - {}
    name: res3a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2c
        - 0
        - 0
        - {}
    name: bn3a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch1
        - 0
        - 0
        - {}
    name: bn3a_branch1
  - class_name: Add
    config: {name: add_20, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2c
        - 0
        - 0
        - &id013 {}
      - - bn3a_branch1
        - 0
        - 0
        - *id013
    name: add_20
  - class_name: Activation
    config: {activation: relu, name: activation_62, trainable: true}
    inbound_nodes:
    - - - add_20
        - 0
        - 0
        - {}
    name: activation_62
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_62
        - 0
        - 0
        - {}
    name: res3b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2a
        - 0
        - 0
        - {}
    name: bn3b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_63, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2a
        - 0
        - 0
        - {}
    name: activation_63
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_63
        - 0
        - 0
        - {}
    name: res3b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2b
        - 0
        - 0
        - {}
    name: bn3b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_64, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2b
        - 0
        - 0
        - {}
    name: activation_64
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_64
        - 0
        - 0
        - {}
    name: res3b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2c
        - 0
        - 0
        - {}
    name: bn3b_branch2c
  - class_name: Add
    config: {name: add_21, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2c
        - 0
        - 0
        - &id014 {}
      - - activation_62
        - 0
        - 0
        - *id014
    name: add_21
  - class_name: Activation
    config: {activation: relu, name: activation_65, trainable: true}
    inbound_nodes:
    - - - add_21
        - 0
        - 0
        - {}
    name: activation_65
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_65
        - 0
        - 0
        - {}
    name: res3c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2a
        - 0
        - 0
        - {}
    name: bn3c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_66, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2a
        - 0
        - 0
        - {}
    name: activation_66
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_66
        - 0
        - 0
        - {}
    name: res3c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2b
        - 0
        - 0
        - {}
    name: bn3c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_67, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2b
        - 0
        - 0
        - {}
    name: activation_67
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_67
        - 0
        - 0
        - {}
    name: res3c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2c
        - 0
        - 0
        - {}
    name: bn3c_branch2c
  - class_name: Add
    config: {name: add_22, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2c
        - 0
        - 0
        - &id015 {}
      - - activation_65
        - 0
        - 0
        - *id015
    name: add_22
  - class_name: Activation
    config: {activation: relu, name: activation_68, trainable: true}
    inbound_nodes:
    - - - add_22
        - 0
        - 0
        - {}
    name: activation_68
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3d_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_68
        - 0
        - 0
        - {}
    name: res3d_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2a
        - 0
        - 0
        - {}
    name: bn3d_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_69, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2a
        - 0
        - 0
        - {}
    name: activation_69
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3d_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_69
        - 0
        - 0
        - {}
    name: res3d_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2b
        - 0
        - 0
        - {}
    name: bn3d_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_70, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2b
        - 0
        - 0
        - {}
    name: activation_70
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3d_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_70
        - 0
        - 0
        - {}
    name: res3d_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2c
        - 0
        - 0
        - {}
    name: bn3d_branch2c
  - class_name: Add
    config: {name: add_23, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2c
        - 0
        - 0
        - &id016 {}
      - - activation_68
        - 0
        - 0
        - *id016
    name: add_23
  - class_name: Activation
    config: {activation: relu, name: activation_71, trainable: true}
    inbound_nodes:
    - - - add_23
        - 0
        - 0
        - {}
    name: activation_71
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res4a_branch2a
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_71
        - 0
        - 0
        - {}
    name: res4a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2a
        - 0
        - 0
        - {}
    name: bn4a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_72, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2a
        - 0
        - 0
        - {}
    name: activation_72
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res4a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_72
        - 0
        - 0
        - {}
    name: res4a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2b
        - 0
        - 0
        - {}
    name: bn4a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_73, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2b
        - 0
        - 0
        - {}
    name: activation_73
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res4a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_73
        - 0
        - 0
        - {}
    name: res4a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res4a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_71
        - 0
        - 0
        - {}
    name: res4a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2c
        - 0
        - 0
        - {}
    name: bn4a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch1
        - 0
        - 0
        - {}
    name: bn4a_branch1
  - class_name: Add
    config: {name: add_24, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2c
        - 0
        - 0
        - &id017 {}
      - - bn4a_branch1
        - 0
        - 0
        - *id017
    name: add_24
  - class_name: Activation
    config: {activation: relu, name: activation_74, trainable: true}
    inbound_nodes:
    - - - add_24
        - 0
        - 0
        - {}
    name: activation_74
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res4b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_74
        - 0
        - 0
        - {}
    name: res4b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4b_branch2a
        - 0
        - 0
        - {}
    name: bn4b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_75, trainable: true}
    inbound_nodes:
    - - - bn4b_branch2a
        - 0
        - 0
        - {}
    name: activation_75
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
