backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [input_3, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 224, 224, 3]
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv1
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_3
        - 0
        - 0
        - {}
    name: conv1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn_conv1
      scale: true
      trainable: true
    inbound_nodes:
    - - - conv1
        - 0
        - 0
        - {}
    name: bn_conv1
  - class_name: Activation
    config: {activation: relu, name: activation_99, trainable: true}
    inbound_nodes:
    - - - bn_conv1
        - 0
        - 0
        - {}
    name: activation_99
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_3
      padding: valid
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - activation_99
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id009 !!python/tuple [1, 1]
      name: res2a_branch2a
      padding: valid
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: res2a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2a
        - 0
        - 0
        - {}
    name: bn2a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_100, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2a
        - 0
        - 0
        - {}
    name: activation_100
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2a_branch2b
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_100
        - 0
        - 0
        - {}
    name: res2a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2b
        - 0
        - 0
        - {}
    name: bn2a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_101, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2b
        - 0
        - 0
        - {}
    name: activation_101
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id010 !!python/tuple [1, 1]
      name: res2a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_101
        - 0
        - 0
        - {}
    name: res2a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id011 !!python/tuple [1, 1]
      name: res2a_branch1
      padding: valid
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: res2a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch2c
        - 0
        - 0
        - {}
    name: bn2a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2a_branch1
        - 0
        - 0
        - {}
    name: bn2a_branch1
  - class_name: Add
    config: {name: add_33, trainable: true}
    inbound_nodes:
    - - - bn2a_branch2c
        - 0
        - 0
        - &id004 {}
      - - bn2a_branch1
        - 0
        - 0
        - *id004
    name: add_33
  - class_name: Activation
    config: {activation: relu, name: activation_102, trainable: true}
    inbound_nodes:
    - - - add_33
        - 0
        - 0
        - {}
    name: activation_102
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id006 !!python/tuple [1, 1]
      name: res2b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_102
        - 0
        - 0
        - {}
    name: res2b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2a
        - 0
        - 0
        - {}
    name: bn2b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_103, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2a
        - 0
        - 0
        - {}
    name: activation_103
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_103
        - 0
        - 0
        - {}
    name: res2b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2b
        - 0
        - 0
        - {}
    name: bn2b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_104, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2b
        - 0
        - 0
        - {}
    name: activation_104
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: &id007 !!python/tuple [1, 1]
      name: res2b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_104
        - 0
        - 0
        - {}
    name: res2b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2b_branch2c
        - 0
        - 0
        - {}
    name: bn2b_branch2c
  - class_name: Add
    config: {name: add_34, trainable: true}
    inbound_nodes:
    - - - bn2b_branch2c
        - 0
        - 0
        - &id005 {}
      - - activation_102
        - 0
        - 0
        - *id005
    name: add_34
  - class_name: Activation
    config: {activation: relu, name: activation_105, trainable: true}
    inbound_nodes:
    - - - add_34
        - 0
        - 0
        - {}
    name: activation_105
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res2c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_105
        - 0
        - 0
        - {}
    name: res2c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2a
        - 0
        - 0
        - {}
    name: bn2c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_106, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2a
        - 0
        - 0
        - {}
    name: activation_106
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res2c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_106
        - 0
        - 0
        - {}
    name: res2c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2b
        - 0
        - 0
        - {}
    name: bn2c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_107, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2b
        - 0
        - 0
        - {}
    name: activation_107
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res2c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_107
        - 0
        - 0
        - {}
    name: res2c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn2c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res2c_branch2c
        - 0
        - 0
        - {}
    name: bn2c_branch2c
  - class_name: Add
    config: {name: add_35, trainable: true}
    inbound_nodes:
    - - - bn2c_branch2c
        - 0
        - 0
        - &id008 {}
      - - activation_105
        - 0
        - 0
        - *id008
    name: add_35
  - class_name: Activation
    config: {activation: relu, name: activation_108, trainable: true}
    inbound_nodes:
    - - - add_35
        - 0
        - 0
        - {}
    name: activation_108
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res3a_branch2a
      padding: valid
      strides: &id012 !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_108
        - 0
        - 0
        - {}
    name: res3a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2a
        - 0
        - 0
        - {}
    name: bn3a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_109, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2a
        - 0
        - 0
        - {}
    name: activation_109
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_109
        - 0
        - 0
        - {}
    name: res3a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2b
        - 0
        - 0
        - {}
    name: bn3a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_110, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2b
        - 0
        - 0
        - {}
    name: activation_110
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res3a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_110
        - 0
        - 0
        - {}
    name: res3a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res3a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_108
        - 0
        - 0
        - {}
    name: res3a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch2c
        - 0
        - 0
        - {}
    name: bn3a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3a_branch1
        - 0
        - 0
        - {}
    name: bn3a_branch1
  - class_name: Add
    config: {name: add_36, trainable: true}
    inbound_nodes:
    - - - bn3a_branch2c
        - 0
        - 0
        - &id013 {}
      - - bn3a_branch1
        - 0
        - 0
        - *id013
    name: add_36
  - class_name: Activation
    config: {activation: relu, name: activation_111, trainable: true}
    inbound_nodes:
    - - - add_36
        - 0
        - 0
        - {}
    name: activation_111
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_111
        - 0
        - 0
        - {}
    name: res3b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2a
        - 0
        - 0
        - {}
    name: bn3b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_112, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2a
        - 0
        - 0
        - {}
    name: activation_112
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3b_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_112
        - 0
        - 0
        - {}
    name: res3b_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2b
        - 0
        - 0
        - {}
    name: bn3b_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_113, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2b
        - 0
        - 0
        - {}
    name: activation_113
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3b_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_113
        - 0
        - 0
        - {}
    name: res3b_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3b_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3b_branch2c
        - 0
        - 0
        - {}
    name: bn3b_branch2c
  - class_name: Add
    config: {name: add_37, trainable: true}
    inbound_nodes:
    - - - bn3b_branch2c
        - 0
        - 0
        - &id014 {}
      - - activation_111
        - 0
        - 0
        - *id014
    name: add_37
  - class_name: Activation
    config: {activation: relu, name: activation_114, trainable: true}
    inbound_nodes:
    - - - add_37
        - 0
        - 0
        - {}
    name: activation_114
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3c_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_114
        - 0
        - 0
        - {}
    name: res3c_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2a
        - 0
        - 0
        - {}
    name: bn3c_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_115, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2a
        - 0
        - 0
        - {}
    name: activation_115
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3c_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_115
        - 0
        - 0
        - {}
    name: res3c_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2b
        - 0
        - 0
        - {}
    name: bn3c_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_116, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2b
        - 0
        - 0
        - {}
    name: activation_116
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3c_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_116
        - 0
        - 0
        - {}
    name: res3c_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3c_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3c_branch2c
        - 0
        - 0
        - {}
    name: bn3c_branch2c
  - class_name: Add
    config: {name: add_38, trainable: true}
    inbound_nodes:
    - - - bn3c_branch2c
        - 0
        - 0
        - &id015 {}
      - - activation_114
        - 0
        - 0
        - *id015
    name: add_38
  - class_name: Activation
    config: {activation: relu, name: activation_117, trainable: true}
    inbound_nodes:
    - - - add_38
        - 0
        - 0
        - {}
    name: activation_117
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res3d_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_117
        - 0
        - 0
        - {}
    name: res3d_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2a
        - 0
        - 0
        - {}
    name: bn3d_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_118, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2a
        - 0
        - 0
        - {}
    name: activation_118
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res3d_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_118
        - 0
        - 0
        - {}
    name: res3d_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2b
        - 0
        - 0
        - {}
    name: bn3d_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_119, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2b
        - 0
        - 0
        - {}
    name: activation_119
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id007
      name: res3d_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_119
        - 0
        - 0
        - {}
    name: res3d_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn3d_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res3d_branch2c
        - 0
        - 0
        - {}
    name: bn3d_branch2c
  - class_name: Add
    config: {name: add_39, trainable: true}
    inbound_nodes:
    - - - bn3d_branch2c
        - 0
        - 0
        - &id016 {}
      - - activation_117
        - 0
        - 0
        - *id016
    name: add_39
  - class_name: Activation
    config: {activation: relu, name: activation_120, trainable: true}
    inbound_nodes:
    - - - add_39
        - 0
        - 0
        - {}
    name: activation_120
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id009
      name: res4a_branch2a
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_120
        - 0
        - 0
        - {}
    name: res4a_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2a
        - 0
        - 0
        - {}
    name: bn4a_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_121, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2a
        - 0
        - 0
        - {}
    name: activation_121
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: res4a_branch2b
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_121
        - 0
        - 0
        - {}
    name: res4a_branch2b
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2b
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2b
        - 0
        - 0
        - {}
    name: bn4a_branch2b
  - class_name: Activation
    config: {activation: relu, name: activation_122, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2b
        - 0
        - 0
        - {}
    name: activation_122
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id010
      name: res4a_branch2c
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_122
        - 0
        - 0
        - {}
    name: res4a_branch2c
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 1024
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id011
      name: res4a_branch1
      padding: valid
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_120
        - 0
        - 0
        - {}
    name: res4a_branch1
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch2c
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch2c
        - 0
        - 0
        - {}
    name: bn4a_branch2c
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4a_branch1
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4a_branch1
        - 0
        - 0
        - {}
    name: bn4a_branch1
  - class_name: Add
    config: {name: add_40, trainable: true}
    inbound_nodes:
    - - - bn4a_branch2c
        - 0
        - 0
        - &id017 {}
      - - bn4a_branch1
        - 0
        - 0
        - *id017
    name: add_40
  - class_name: Activation
    config: {activation: relu, name: activation_123, trainable: true}
    inbound_nodes:
    - - - add_40
        - 0
        - 0
        - {}
    name: activation_123
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: *id006
      name: res4b_branch2a
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - activation_123
        - 0
        - 0
        - {}
    name: res4b_branch2a
  - class_name: BatchNormalization
    config:
      axis: 3
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: bn4b_branch2a
      scale: true
      trainable: true
    inbound_nodes:
    - - - res4b_branch2a
        - 0
        - 0
        - {}
    name: bn4b_branch2a
  - class_name: Activation
    config: {activation: relu, name: activation_124, trainable: true}
    inbound_nodes:
    - - - bn4b_branch2a
        - 0
        - 0
        - {}
    name: activation_124
  - class_name: Conv2D
    config:
